---
kind: property
id: P:Autodesk.Revit.DB.Visual.Hardwood.HardwoodColor
source: html/22ef96b7-ec16-4e43-695c-1c76f2960b43.htm
---
# Autodesk.Revit.DB.Visual.Hardwood.HardwoodColor Property

The property labeled "Image" from the "Hardwood" schema.

## Syntax (C#)
```csharp
public static string HardwoodColor { get; }
```

## Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.